Repository: maksgranko/MFTP
Catalog: Resources/Localizations/*.resx
Languages: ru_ru

# Error_AccessDenied
source: Access denied!
ru_ru: Доступ запрещён.

# Error_BadAddress
source: Bad address. Write address same: "C:/Users/Admin/Desktop"
ru_ru: Неверный адрес. Пример адреса: "C:/Users/Admin/Desktop"

# Error_BadPort
source: Port is incorrect!
ru_ru: Неверный порт!

# Error_BadPortSave
source: This port is can't be saved.
ru_ru: Порт не может быть сохранён.

# Error_Connection_Refused
source: Connection refused. Check your Username or Password.
ru_ru: Подключение принудительно разорвано. Неверный логин или пароль.

# Error_Connection_Refused_Simple
source: Connection refused.
ru_ru: Подключение принудительно разорвано.

# Error_DirFileNotFound
source: This directory/file is not found.
ru_ru: Данная директория/файл не найдена.

# Error_EmptyAddress
source: Default folder isn't detected... Redirecting to disk list.
ru_ru: Отсутствует папка по умолчанию... Переходим к списку дисков.

# Error_FolderError
source: Folder error.
ru_ru: Ошибка папки.

# Error_Incorrect_IP
source: Please, input correct IP Address.
ru_ru: Неправильный IP!

# Error_IsntConnected
source: Server is unavailable. Connection has been closed.
ru_ru: Отсутствует соединение с сервером.

# Error_IsntDeleted
source: One of this files or directories can't be deleted.(named as ".." or same exception)
ru_ru: Один из файлов/директорий не может быть удалён!(вероятно, вы выделили ".." при удалении.)

# Error_IsntDownloaded
source: One of this files or directories can't be downloaded(named as ".." or same exception)
ru_ru: Один из файлов/директорий не может быть загружен!(вероятно, вы выделили ".." при загрузке.)

# Error_IsntMoved
source: One of this files or directories can't be copied/moved(named as ".." or same exception)
ru_ru: Один из файлов/директорий не может быть перемещён!(вероятно, вы выделили ".." при перемещении.)

# Error_IsntOpened
source: File/Folder is can't be open now!
ru_ru: Файл или папка не может быть открыт(а).

# Error_IsntRenamed
source: This file or directory can't be renamed.
ru_ru: Невозможно переименовать файл/директорию!

# Error_IsntUpload
source: One of this files or directories can't be uploaded(named as ".." or same exception)
ru_ru: Один из файлов/директорий не может быть выгружен!(вероятно, вы выделили ".." при выгрузке.)

# Error_MovingError
source: Moving error.
ru_ru: Ошибка перемещения файла.

# Error_PortLost
source: Port of recent server has been lost! Setting default port.
ru_ru: Порт недавнего сервера был потерян! Установлен стандартный порт.

# Error_PortOutOfRange
source: Write correct port from 0 to 65535!
ru_ru: Порт вышел за пределы! Допустимое значение от 0 до 65535.

# Error_RecentNotFound
source: Authorize once to FTP-server for adding server to Recent.
ru_ru: Авторизируйтесь хотябы на один FTP-сервер, чтобы появились недавние сервера.

# Error_RefreshingUnavailable
source: Refreshing is unavailable.
ru_ru: Невозможно обновить списки.

# Error_RefreshingUnavailableServer
source: Client isn't connected to server. Refreshing is unavalable.
ru_ru: Клиент не подключён к серверу. Обновление списка невозможно.

# Error_SelectDisk
source: Please, select disk.
ru_ru: Пожалуйста, выберите диск.

# Error_SelectDiskToDownload
source: Select disk or folder to download files/folders!
ru_ru: Выберите диск для того, чтобы загрузить выбранные файлы/папки!

# Error_SettingAddressDefault
source: Unexcepted error. Setting folder to default.
ru_ru: Неизвестная ошибка. Указываем адрес на корневой.

# Error_Timeout
source: Connection timeout. Check your settings, server or internet connection.
ru_ru: Время ожидания истекло. Проверьте ваше соединение с сервером и интернетом.

# Error_TooFast
source: Too fast!
ru_ru: Слишком быстро!

# Error_UnexceptedError
source: Unexcepted error.
ru_ru: Неизвестная ошибка.

# Error_UnsupportedIP
source: IP supports only IPv6 or IPv4. Check IP Address.
ru_ru: Данный адрес не поддерживается! Поддерживаются только IPv6 и IPv4.

# Info_Authenticated
source: Authenticated
ru_ru: Аутентифицирован

# Info_Authorized
source: Authorized!
ru_ru: Авторизирован!

# Info_CantChangeDir
source: Directory changing is unavailable now.
ru_ru: Сейчас невозможно изменить директорию.

# Info_Closed
source: Closed.
ru_ru: Закрыто.

# Info_Connect
source: Connect
ru_ru: Подключиться

# Info_Connected
source: Connected
ru_ru: Подключено!

# Info_Connecting
source: Connecting...
ru_ru: Подключение...

# Info_Create
source: Create!
ru_ru: Создать!

# Info_Disconnect
source: Disconnect
ru_ru: Отключиться

# Info_Disconnected
source: Disconnected
ru_ru: Соединение разорвано.

# Info_Disconnected_by_Prog
source: Connection closed by MFTP.
ru_ru: Соединение разорвано программой.

# Info_Disconnected_by_User
source: Connection closed by User.
ru_ru: Соединение разорвано пользователем.

# Info_Encode_Default
source: Encoding setted to default value.
ru_ru: Кодировка была установлена по умолчанию.

# Info_Example
source: Example.txt
ru_ru: Файл.txt

# Info_InputNameFolder
source: Input new name for New Folder:
ru_ru: Введите название папки

# Info_InputNewName
source: Input new name for File/Folder:
ru_ru: Введите новое название файла\папки

# Info_Joining
source: Joining...
ru_ru: Подключаемся...

# Info_Move
source: Move
ru_ru: Переместить

# Info_MoveThere
source: Move there
ru_ru: Переместить сюда

# Info_NewFolder
source: New Folder
ru_ru: Новая папка

# Info_PortSaved
source: Custom port has been saved!
ru_ru: Порт был успешно сохранён!

# Info_RenameIt
source: Rename it!
ru_ru: Переименовать!

source: null
ru_ru: Пусто

# Text_Apply
source: Apply
ru_ru: Применить

# Text_Auto
source: Auto
ru_ru: Авто

# Text_Clear
source: Clear
ru_ru: Очистить

# Text_CreateFile
source: Create File
ru_ru: Создать файл

# Text_CreateFolder
source: Create Folder
ru_ru: Создать папку

# Text_CustomPort
source: Custom Port
ru_ru: Указать порт

# Text_Delete
source: Delete
ru_ru: Удалить

# Text_Download
source: Download
ru_ru: Скачать

# Text_File
source: File
ru_ru: Файл

# Text_Folder
source: Folder
ru_ru: Папка

# Text_FTPType
source: FTP Type
ru_ru: Тип FTP подкл.

# Text_Open
source: Open
ru_ru: Открыть

# Text_Password
source: Password:
ru_ru: Пароль:

# Text_Properties
source: Properties
ru_ru: Свойства

# Text_Properties_AddInfo
source: Additional information
ru_ru: Дополнительная информация

# Text_Properties_Address
source: Address:
ru_ru: Путь:

# Text_Properties_Advanced
source: Advanced:
ru_ru: Доп. инф.:

# Text_Properties_BasicInfo
source: Basic information
ru_ru: Базовая информация

# Text_Properties_Filename
source: File name:
ru_ru: Имя файла:

# Text_Properties_FilenameInvalid
source: File is unavailable
ru_ru: Файл недоступен.

# Text_Properties_ModDate
source: Mod. date:
ru_ru: Дата мод.:

# Text_Properties_NoPerms
source: No permissions.
ru_ru: Нет прав.

# Text_Properties_Size
source: Size:
ru_ru: Размер:

# Text_Recent
source: Recent
ru_ru: Недавние

# Text_Refresh
source: Refresh
ru_ru: Обновить

# Text_Rename
source: Rename
ru_ru: Переименовать

# Text_Settings
source: Settings
ru_ru: Настройки

# Text_Settings_AutoEncode
source: Auto Encoding
ru_ru: Авто кодировка

# Text_Settings_BetaFunctional
source: Beta functional
ru_ru: Бета функции

# Text_Settings_BetaMessage
source: Beta functional is unstable, and don't/bad working and it has been planed in program. Label colors: RED: Function isn't working. YELLOW: Function unstable. WHITE: New function, uncategorized(or developer is lazy)
ru_ru: Бета функционал нестабилен, он может работать или работать плохо/нестабильно. Пометки цветом: Красный: Функция не работает. Желтый:Функция нестабильна. Белый:Новая функция без категории(или разработчику было лень указать)

# Text_Settings_Encoding
source: Encoding
ru_ru: Кодировка

# Text_Settings_ForceASCII
source: Force ASCII
ru_ru: Принуд. ASCII

# Text_Settings_ForceUTF7
source: Force UTF7
ru_ru: Принуд. UTF7

# Text_Settings_ForceUTF8
source: Force UTF8
ru_ru: Принуд. UTF8

# Text_Settings_FXPProto
source: FXP Protocol
ru_ru: FXP Протокол

# Text_Settings_Language
source: Language
ru_ru: Язык

# Text_Settings_LanguageMessage
source: Language changing isn't instantly! Restart needed.
ru_ru: Изменение языка происходит не мгновенно! Требуется перезагрузка.

# Text_Settings_Other
source: Other
ru_ru: Другое

# Text_Upload
source: Upload
ru_ru: Загрузить

# Text_Username
source: Username:
ru_ru: Логин:
